## Stage C Assessment Test

In [1]:
# Import libraries
import pandas as pd
import numpy as np

### Question 1: Which country produced the highest amount of oats in 2010?

In [2]:
# open the food production dataset and view the first 5 rows
foodprod = pd.read_csv('Africa Food Production.csv')
foodprod.head()

   Country                Item  Year  Value
0  Algeria  Wheat and products  2004   2731
1  Algeria  Wheat and products  2005   2415
2  Algeria  Wheat and products  2006   2688
3  Algeria  Wheat and products  2007   2319
4  Algeria  Wheat and products  2008   1111

In [3]:
# Extract oats data for the year 2010
oat_2010 = foodprod.query("Item == 'Oats' & Year == 2010").sort_values(by="Value", ascending=False)
oat_2010

            Country  Item  Year  Value
46          Algeria  Oats  2010     88
6406       Ethiopia  Oats  2010     48
13186       Morocco  Oats  2010     37
17816  South Africa  Oats  2010     34
9286          Kenya  Oats  2010      3
20056       Tunisia  Oats  2010      2
22516      Zimbabwe  Oats  2010      1
7746          Ghana  Oats  2010      0
10026       Lesotho  Oats  2010      0

> Answer: _Algeria_ with 88 kilotonnes of oat in 2010.

### Question 2: Which three countries had the lowest food supply between 2004 and 2006 respectively(inclusive)?

In [4]:
# Opening and viewing the first 5 rows of the food supply dataset

foodsupply = pd.read_csv('Africa Food Supply.csv')
foodsupply.head()

   Country  Year  Value
0  Algeria  2004   2987
1  Algeria  2005   2958
2  Algeria  2006   3047
3  Algeria  2007   3041
4  Algeria  2008   3048

In [5]:
# Extracting data for the year 2004 - 2006
yr04_to_06 = foodsupply.query("Year in [2004, 2005, 2006]")

# Grouping by total food Supply per Country
yr04_to_06_df = yr04_to_06.groupby('Country', as_index = False)['Value'].sum()
yr04_to_06_df.sort_values(by = 'Value', ascending= True, inplace =True)
yr04_to_06_df.head(3)

                     Country  Value
43                    Zambia   5577
13                  Ethiopia   5827
7   Central African Republic   6044

> Answer:  Zambia, Ethiopia, Central African Republic.

### Question 3: What three countries have produced the highest total quantity of rice from 2004 to 2013?

In [6]:
# Extract the dataset for rice production in African countries over the years
rice_df = foodprod.query("Item == 'Rice (Milled Equivalent)'")
 
# get the sum of rice produced per country per year
rice_tot = rice_df.groupby(['Country', 'Year'], as_index = False)['Value'].sum()


rice_tot.groupby(['Country'], as_index=False)['Value'].mean().sort_values('Value', ascending=False).head(3)

       Country   Value
9        Egypt  4037.0
26     Nigeria  2696.4
18  Madagascar  2611.8

> Answer:  Egypt, Nigeria, Madagascar.

### Question 4: The median gives a better idea of a dataset than the mean because it is not affected by larger or smaller values?

> Answer : True

## Question 5: Which one of the following represents the datapoints that lie outside the middle 50% in a sample of numbers?

> #### Answer:
> Outliers